#language: ru
@orders

Функционал: Оформление заказа клиента

Как менеджер по продажам
Я хочу оформить и провести заказ клиента
Чтобы зарезервировать товар под клиента

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий
	И я закрываю все окна клиентского приложения

Сценарий: Заказ с заполненными реквизитами проводится
	Когда Я открываю навигационную ссылку "e1cib/list/Документ.ЗаказКлиента"
	Тогда открылось окно "Заказы клиентов"
	И я нажимаю на кнопку с именем "СписокСоздать"
	Тогда открылось окно "Заказ клиента (создание)*"

	И в поле с именем "ПартнерБезКЛ" я ввожу текст "КД Тестовый клиент"
	И я перехожу к следующему реквизиту
	И пауза 2
	Тогда элемент формы с именем "Соглашение" стал равен "КД Тестовое соглашение"
	И элемент формы с именем "Склад" стал равен "КД Основной склад"

	И я перехожу к закладке "Товары"
	И в таблице 'Товары' я нажимаю на кнопку с именем 'ТоварыДобавить'
	И в таблице 'Товары' из выпадающего списка с именем 'ТоварыНоменклатура' я выбираю точное значение "КД Тестовый товар"
	И я перехожу к следующему реквизиту
	И в таблице 'Товары' я активизирую поле с именем 'ТоварыКоличествоУпаковок'
	И в таблице 'Товары' в поле с именем 'ТоварыКоличествоУпаковок' я ввожу текст "1,000"
	И в таблице 'Товары' я активизирую поле с именем 'ТоварыВидЦены'
	И в таблице 'Товары' в поле с именем 'ТоварыВидЦены' я ввожу текст ""
	И в таблице 'Товары' я завершаю редактирование строки
	И в таблице 'Товары' я активизирую поле с именем 'ТоварыЦена'
	И в таблице 'Товары' в поле с именем 'ТоварыЦена' я ввожу текст "100,00"
	И в таблице 'Товары' я завершаю редактирование строки
	Тогда таблица "Товары" содержит строки:
		| "Номенклатура"      | "Количество" |
		| "КД Тестовый товар" | "1,000"      |

	И я нажимаю на кнопку с именем "ФормаПровести"
	И пауза 3
	И я запоминаю значение поля с именем "Номер" как "НомерЗаказа"
	И я нажимаю на кнопку с именем "ФормаПровестиИЗакрыть"
	И я жду закрытия окна "Заказ клиента *" в течение 20 секунд
	Когда Я открываю навигационную ссылку "e1cib/list/Документ.ЗаказКлиента"
	Тогда открылось окно "Заказы клиентов"
	И таблица "Список" содержит строки:
		| "Номер"         |
		| "$НомерЗаказа$" |
	И я закрываю сеанс TESTCLIENT

Сценарий: Заказ без клиента не проводится
	Когда Я открываю навигационную ссылку "e1cib/list/Документ.ЗаказКлиента"
	Тогда открылось окно "Заказы клиентов"
	И я нажимаю на кнопку с именем "СписокСоздать"
	Тогда открылось окно "Заказ клиента (создание)*"
	И я нажимаю на кнопку с именем "ФормаПровести"
	Тогда в логе сообщений TestClient есть строка по шаблону "*не заполнен*"
	И я закрываю текущее окно
	И я нажимаю на кнопку "Нет"
	И я закрываю сеанс TESTCLIENT
