#language: ru
@smoke

Функционал: Справочник кд_Проба в расширении КонтурДоработки

Как контур разработки
Я хочу открыть свой справочник из расширения
Чтобы проверить цепочку XML → Apply → Vanessa

Сценарий: Список справочника открывается по навигационной ссылке
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий
	И Я открываю навигационную ссылку "e1cib/list/Справочник.кд_Проба"
	Тогда открылось окно "Проба контура"
	И я закрываю текущее окно
	И я закрываю сеанс TESTCLIENT
